# 문제 3~11

In [1]:
import numpy as np

In [2]:
a = np.array([1,2,3,4,5,6])
a

array([1, 2, 3, 4, 5, 6])

In [3]:
b = np.arange(1, 7)
b

array([1, 2, 3, 4, 5, 6])

In [4]:
a.shape, a.size, a.ndim

((6,), 6, 1)

In [5]:
c = a.reshape(2, 3)
c

array([[1, 2, 3],
       [4, 5, 6]])

In [6]:
d = b.reshape(3, 2)
d

array([[1, 2],
       [3, 4],
       [5, 6]])

In [7]:
a * b, np.dot(c, d)

(array([ 1,  4,  9, 16, 25, 36]),
 array([[22, 28],
        [49, 64]]))

In [8]:
np.max(c, axis=1)

array([3, 6])

In [9]:
np.sum(d, axis=0)

array([ 9, 12])

In [10]:
c

array([[1, 2, 3],
       [4, 5, 6]])

In [11]:
d

array([[1, 2],
       [3, 4],
       [5, 6]])

In [12]:
# 1~6까지 주사위값 생성
np.random.seed(123)
e = np.random.randint(1, 7, size=(2,3))
e

array([[6, 3, 5],
       [3, 2, 4]])

In [13]:
np.sort(e, axis=1)

array([[3, 5, 6],
       [2, 3, 4]])

In [14]:
c[0, 2], c[0, -1]

(3, 3)

In [15]:
d[1:, 1], d[1:3, 1], d[1:3, -1]

(array([4, 6]), array([4, 6]), array([4, 6]))

In [16]:
d % 2 == 0, d[d % 2 ==0] # Boolean Indexing

(array([[False,  True],
        [False,  True],
        [False,  True]]),
 array([2, 4, 6]))

# 문제 12~19

In [17]:
import pandas as pd

In [18]:
df = pd.read_csv('score.csv')
df

   반  번호  이름  성별    수학     IT
0  3   1  지민  남자  88.8  100.0
1  4   2  정국  남자  85.3   88.5
2  5   3  소연  여자  75.2   88.3
3  6   4  태연  여자  81.0   85.8

In [19]:
df.head(2)

   반  번호  이름  성별    수학     IT
0  3   1  지민  남자  88.8  100.0
1  4   2  정국  남자  85.3   88.5

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   반       4 non-null      int64
 1   번호      4 non-null      int64
 2   이름      4 non-null      object
 3   성별      4 non-null      object
 4   수학      4 non-null      float64
 5   IT      4 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 320.0+ bytes

In [21]:
df.describe()

              반        번호         수학          IT
count  4.000000  4.000000   4.000000    4.000000
mean   4.500000  2.500000  82.575000   90.650000
std    1.290994  1.290994   5.860816    6.353214
min    3.000000  1.000000  75.200000   85.800000
25%    3.750000  1.750000  79.550000   87.675000
50%    4.500000  2.500000  83.150000   88.400000
75%    5.250000  3.250000  86.175000   91.375000
max    6.000000  4.000000  88.800000  100.000000

In [22]:
df.index += 1
df

   반  번호  이름  성별    수학     IT
1  3   1  지민  남자  88.8  100.0
2  4   2  정국  남자  85.3   88.5
3  5   3  소연  여자  75.2   88.3
4  6   4  태연  여자  81.0   85.8

In [23]:
df[['반', '이름']]

   반  이름
1  3  지민
2  4  정국
3  5  소연
4  6  태연

In [24]:
df.iloc[1], df.loc[2]

(반        4
 번호       2
 이름      정국
 성별      남자
 수학    85.3
 IT    88.5
 Name: 2, dtype: object,
 반        4
 번호       2
 이름      정국
 성별      남자
 수학    85.3
 IT    88.5
 Name: 2, dtype: object)

In [25]:
df.loc[[2, 3]]

   반  번호  이름  성별    수학    IT
2  4   2  정국  남자  85.3  88.5
3  5   3  소연  여자  75.2  88.3

In [27]:
df[df.수학 >= 85], df.loc[df.수학 >= 85], df.query('수학 >= 85')

(   반  번호  이름  성별    수학     IT
 1  3   1  지민  남자  88.8  100.0
 2  4   2  정국  남자  85.3   88.5,
    반  번호  이름  성별    수학     IT
 1  3   1  지민  남자  88.8  100.0
 2  4   2  정국  남자  85.3   88.5,
    반  번호  이름  성별    수학     IT
 1  3   1  지민  남자  88.8  100.0
 2  4   2  정국  남자  85.3   88.5)

In [28]:
df.loc[5] = [3, 2, '아이유', '여자', 100, 100]  # 행 데이터 추가
df

   반  번호   이름  성별     수학     IT
1  3   1   지민  남자   88.8  100.0
2  4   2   정국  남자   85.3   88.5
3  5   3   소연  여자   75.2   88.3
4  6   4   태연  여자   81.0   85.8
5  3   2  아이유  여자  100.0  100.0

In [32]:
df.drop(4, inplace=True)
df

   반  번호   이름  성별     수학     IT
1  3   1   지민  남자   88.8  100.0
2  4   2   정국  남자   85.3   88.5
3  5   3   소연  여자   75.2   88.3
5  3   2  아이유  여자  100.0  100.0

In [33]:
df.drop('IT', axis=1)

   반  번호   이름  성별     수학
1  3   1   지민  남자   88.8
2  4   2   정국  남자   85.3
3  5   3   소연  여자   75.2
5  3   2  아이유  여자  100.0

In [34]:
df.sort_values(by=['반', '수학'], ascending=[True,False])

   반  번호   이름  성별     수학     IT
5  3   2  아이유  여자  100.0  100.0
1  3   1   지민  남자   88.8  100.0
2  4   2   정국  남자   85.3   88.5
3  5   3   소연  여자   75.2   88.3

In [40]:
df.isnull().sum(), df.fillna(value=0), df.dropna()

(반     0
 번호    0
 이름    0
 성별    0
 수학    0
 IT    0
 dtype: int64,
    반  번호   이름  성별     수학     IT
 1  3   1   지민  남자   88.8  100.0
 2  4   2   정국  남자   85.3   88.5
 3  5   3   소연  여자   75.2   88.3
 5  3   2  아이유  여자  100.0  100.0,
    반  번호   이름  성별     수학     IT
 1  3   1   지민  남자   88.8  100.0
 2  4   2   정국  남자   85.3   88.5
 3  5   3   소연  여자   75.2   88.3
 5  3   2  아이유  여자  100.0  100.0)

# 문제 21~25

In [41]:
import pandas as pd

In [47]:
df = pd.read_csv('df.csv')
df  # 첫 번째 DataFrame

   반  번호   이름  성별     수학
0  3   1   지민  남자   88.8
1  3   2  아이유  여자  100.0
2  4   2   정국  남자   85.3
3  5   3   소연  여자   75.2
4  6   4   태연  여자   81.0

In [48]:
df2 = pd.read_csv('df2.csv')
df2  # 두 번째 DataFrame

    이름     IT
0   지민  100.0
1  아이유  100.0
2   정국   88.5
3   소연   88.3
4   태연   85.3

In [49]:
pd.concat([df, df2], axis=1)

   반  번호   이름  성별     수학   이름     IT
0  3   1   지민  남자   88.8   지민  100.0
1  3   2  아이유  여자  100.0  아이유  100.0
2  4   2   정국  남자   85.3   정국   88.5
3  5   3   소연  여자   75.2   소연   88.3
4  6   4   태연  여자   81.0   태연   85.3

In [50]:
df = df.drop(1).reset_index(drop=True)
# 첫 번째 DataFrame에서 아이유 삭제 후 reset_index() 수행
df

   반  번호  이름  성별    수학
0  3   1  지민  남자  88.8
1  4   2  정국  남자  85.3
2  5   3  소연  여자  75.2
3  6   4  태연  여자  81.0

In [52]:
df2 = df2.drop([2, 4]).reset_index(drop=True)
# 두 번째 DataFrame에서 정국, 태연 삭제 후 reset_index() 수행
df2

    이름     IT
0   지민  100.0
1  아이유  100.0
2   소연   88.3

In [53]:
pd.merge(df, df2, on='이름', how='inner')  # 이름 기준 병합 1

   반  번호  이름  성별    수학     IT
0  3   1  지민  남자  88.8  100.0
1  5   3  소연  여자  75.2   88.3

In [54]:
pd.merge(df, df2, on='이름', how='left')  # 이름 기준 병합 2

   반  번호  이름  성별    수학     IT
0  3   1  지민  남자  88.8  100.0
1  4   2  정국  남자  85.3    NaN
2  5   3  소연  여자  75.2   88.3
3  6   4  태연  여자  81.0    NaN

In [55]:
pd.merge(df, df2, on='이름', how='outer')  # 이름 기준 병합 3

     반   번호   이름   성별    수학     IT
0  3.0  1.0   지민   남자  88.8  100.0
1  4.0  2.0   정국   남자  85.3    NaN
2  5.0  3.0   소연   여자  75.2   88.3
3  6.0  4.0   태연   여자  81.0    NaN
4  NaN  NaN  아이유  NaN   NaN  100.0

In [56]:
pd.merge(df, df2, on='이름', how='right')  # 이름 기준 병합 4

     반   번호   이름   성별    수학     IT
0  3.0  1.0   지민   남자  88.8  100.0
1  NaN  NaN  아이유  NaN   NaN  100.0
2  5.0  3.0   소연   여자  75.2   88.3

In [58]:
my_map = {'남자':0, '여자':1}
df['성별코드'] = df.성별.map(my_map)
df

   반  번호  이름  성별    수학  성별코드
0  3   1  지민  남자  88.8     0
1  4   2  정국  남자  85.3     0
2  5   3  소연  여자  75.2     1
3  6   4  태연  여자  81.0     1

In [59]:
df.성별코드.value_counts()

1    2
0    2
Name: 성별코드, dtype: int64

In [60]:
pd.pivot_table(df, index='반', columns='성별', values='수학')

성별    남자    여자
반
3   88.8   NaN
4   85.3   NaN
5    NaN  75.2
6    NaN  81.0

In [61]:
pd.DataFrame(df.groupby(['반', '성별'])['수학'].mean())

        수학
반 성별
3 남자  88.8
4 남자  85.3
5 여자  75.2
6 여자  81.0